MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K80/mcu.h
// Register: BRGCON3
#define BRGCON3 BRGCON3
extern volatile unsigned char           BRGCON3             __at(0xE45);
#ifndef _LIB_BUILD
asm("BRGCON3 equ 0E45h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG2PH                 :3;
        unsigned                        :3;
        unsigned WAKFIL                 :1;
        unsigned WAKDIS                 :1;
    };
    struct {
        unsigned SEG2PH0                :1;
        unsigned SEG2PH1                :1;
        unsigned SEG2PH2                :1;
    };
} BRGCON3bits_t;
extern volatile BRGCON3bits_t BRGCON3bits __at(0xE45);
// bitfield macros
#define _BRGCON3_SEG2PH_POSN                                0x0
#define _BRGCON3_SEG2PH_POSITION                            0x0
#define _BRGCON3_SEG2PH_SIZE                                0x3
#define _BRGCON3_SEG2PH_LENGTH                              0x3
#define _BRGCON3_SEG2PH_MASK                                0x7
#define _BRGCON3_WAKFIL_POSN                                0x6
#define _BRGCON3_WAKFIL_POSITION                            0x6
#define _BRGCON3_WAKFIL_SIZE                                0x1
#define _BRGCON3_WAKFIL_LENGTH                              0x1
#define _BRGCON3_WAKFIL_MASK                                0x40
#define _BRGCON3_WAKDIS_POSN                                0x7
#define _BRGCON3_WAKDIS_POSITION                            0x7
#define _BRGCON3_WAKDIS_SIZE                                0x1
#define _BRGCON3_WAKDIS_LENGTH                              0x1
#define _BRGCON3_WAKDIS_MASK                                0x80
#define _BRGCON3_SEG2PH0_POSN                               0x0
#define _BRGCON3_SEG2PH0_POSITION                           0x0
#define _BRGCON3_SEG2PH0_SIZE                               0x1
#define _BRGCON3_SEG2PH0_LENGTH                             0x1
#define _BRGCON3_SEG2PH0_MASK                               0x1
#define _BRGCON3_SEG2PH1_POSN                               0x1
#define _BRGCON3_SEG2PH1_POSITION                           0x1
#define _BRGCON3_SEG2PH1_SIZE                               0x1
#define _BRGCON3_SEG2PH1_LENGTH                             0x1
#define _BRGCON3_SEG2PH1_MASK                               0x2
#define _BRGCON3_SEG2PH2_POSN                               0x2
#define _BRGCON3_SEG2PH2_POSITION                           0x2
#define _BRGCON3_SEG2PH2_SIZE                               0x1
#define _BRGCON3_SEG2PH2_LENGTH                             0x1
#define _BRGCON3_SEG2PH2_MASK                               0x4

// Register: RXFCON0
#define RXFCON0 RXFCON0
extern volatile unsigned char           RXFCON0             __at(0xE46);
#ifndef _LIB_BUILD
asm("RXFCON0 equ 0E46h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXF0EN                 :1;
        unsigned RXF1EN                 :1;
        unsigned RXF2EN                 :1;
        unsigned RXF3EN                 :1;
        unsigned RXF4EN                 :1;
        unsigned RXF5EN                 :1;
        unsigned RXF6EN                 :1;
        unsigned RXF7EN                 :1;
    };
} RXFCON0bits_t;
extern volatile RXFCON0bits_t RXFCON0bits __at(0xE46);
// bitfield macros
#define _RXFCON0_RXF0EN_POSN                                0x0
#define _RXFCON0_RXF0EN_POSITION                            0x0
#define _RXFCON0_RXF0EN_SIZE                                0x1
#define _RXFCON0_RXF0EN_LENGTH                              0x1
#define _RXFCON0_RXF0EN_MASK                                0x1
#define _RXFCON0_RXF1EN_POSN                                0x1
#define _RXFCON0_RXF1EN_POSITION                            0x1
#define _RXFCON0_RXF1EN_SIZE                                0x1
#define _RXFCON0_RXF1EN_LENGTH                              0x1
#define _RXFCON0_RXF1EN_MASK                                0x2
#define _RXFCON0_RXF2EN_POSN                                0x2
#define _RXFCON0_RXF2EN_POSITION                            0x2
#define _RXFCON0_RXF2EN_SIZE                                0x1
#define _RXFCON0_RXF2EN_LENGTH                              0x1
#define _RXFCON0_RXF2EN_MASK                                0x4
#define _RXFCON0_RXF3EN_POSN                                0x3
#define _RXFCON0_RXF3EN_POSITION                            0x3
#define _RXFCON0_RXF3EN_SIZE                                0x1
#define _RXFCON0_RXF3EN_LENGTH                              0x1
#define _RXFCON0_RXF3EN_MASK                                0x8
#define _RXFCON0_RXF4EN_POSN                                0x4
#define _RXFCON0_RXF4EN_POSITION                            0x4
#define _RXFCON0_RXF4EN_SIZE                                0x1
#define _RXFCON0_RXF4EN_LENGTH                              0x1
#define _RXFCON0_RXF4EN_MASK                                0x10
#define _RXFCON0_RXF5EN_POSN                                0x5
#define _RXFCON0_RXF5EN_POSITION                            0x5
#define _RXFCON0_RXF5EN_SIZE                                0x1
#define _RXFCON0_RXF5EN_LENGTH                              0x1
#define _RXFCON0_RXF5EN_MASK                                0x20
#define _RXFCON0_RXF6EN_POSN                                0x6
#define _RXFCON0_RXF6EN_POSITION                            0x6
#define _RXFCON0_RXF6EN_SIZE                                0x1
#define _RXFCON0_RXF6EN_LENGTH                              0x1
#define _RXFCON0_RXF6EN_MASK                                0x40
#define _RXFCON0_RXF7EN_POSN                                0x7
#define _RXFCON0_RXF7EN_POSITION                            0x7
#define _RXFCON0_RXF7EN_SIZE                                0x1
#define _RXFCON0_RXF7EN_LENGTH                              0x1
#define _RXFCON0_RXF7EN_MASK                                0x80

// Register: RXFCON1
#define RXFCON1 RXFCON1
extern volatile unsigned char           RXFCON1             __at(0xE47);
#ifndef _LIB_BUILD
asm("RXFCON1 equ 0E47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXF8EN                 :1;
        unsigned RXF9EN                 :1;
        unsigned RXF10EN                :1;
        unsigned RXF11EN                :1;
        unsigned RXF12EN                :1;
        unsigned RXF13EN                :1;
        unsigned RXF14EN                :1;
        unsigned RXF15EN                :1;
    };
} RXFCON1bits_t;
extern volatile RXFCON1bits_t RXFCON1bits __at(0xE47);
// bitfield macros
#define _RXFCON1_RXF8EN_POSN                                0x0
#define _RXFCON1_RXF8EN_POSITION                            0x0
#define _RXFCON1_RXF8EN_SIZE                                0x1
#define _RXFCON1_RXF8EN_LENGTH                              0x1
#define _RXFCON1_RXF8EN_MASK                                0x1
#define _RXFCON1_RXF9EN_POSN                                0x1
#define _RXFCON1_RXF9EN_POSITION                            0x1
#define _RXFCON1_RXF9EN_SIZE                                0x1
#define _RXFCON1_RXF9EN_LENGTH                              0x1
#define _RXFCON1_RXF9EN_MASK                                0x2
#define _RXFCON1_RXF10EN_POSN                               0x2
#define _RXFCON1_RXF10EN_POSITION                           0x2
#define _RXFCON1_RXF10EN_SIZE                               0x1
#define _RXFCON1_RXF10EN_LENGTH                             0x1
#define _RXFCON1_RXF10EN_MASK                               0x4
#define _RXFCON1_RXF11EN_POSN                               0x3
#define _RXFCON1_RXF11EN_POSITION                           0x3
#define _RXFCON1_RXF11EN_SIZE                               0x1
#define _RXFCON1_RXF11EN_LENGTH                             0x1
#define _RXFCON1_RXF11EN_MASK                               0x8
#define _RXFCON1_RXF12EN_POSN                               0x4
#define _RXFCON1_RXF12EN_POSITION                           0x4
#define _RXFCON1_RXF12EN_SIZE                               0x1
#define _RXFCON1_RXF12EN_LENGTH                             0x1
#define _RXFCON1_RXF12EN_MASK                               0x10
#define _RXFCON1_RXF13EN_POSN                               0x5
#define _RXFCON1_RXF13EN_POSITION                           0x5
#define _RXFCON1_RXF13EN_SIZE                               0x1
#define _RXFCON1_RXF13EN_LENGTH                             0x1
#define _RXFCON1_RXF13EN_MASK                               0x20
#define _RXFCON1_RXF14EN_POSN                               0x6
#define _RXFCON1_RXF14EN_POSITION                           0x6
#define _RXFCON1_RXF14EN_SIZE                               0x1
#define _RXFCON1_RXF14EN_LENGTH                             0x1
#define _RXFCON1_RXF14EN_MASK                               0x40
#define _RXFCON1_RXF15EN_POSN                               0x7
#define _RXFCON1_RXF15EN_POSITION                           0x7
#define _RXFCON1_RXF15EN_SIZE                               0x1
#define _RXFCON1_RXF15EN_LENGTH                             0x1
#define _RXFCON1_RXF15EN_MASK                               0x80

