MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K80/mcu.h
extern volatile B1D6bits_t B1D6bits __at(0xE9C);
// bitfield macros
#define _B1D6_B1D6_POSN                                     0x0
#define _B1D6_B1D6_POSITION                                 0x0
#define _B1D6_B1D6_SIZE                                     0x8
#define _B1D6_B1D6_LENGTH                                   0x8
#define _B1D6_B1D6_MASK                                     0xFF
#define _B1D6_B1D60_POSN                                    0x0
#define _B1D6_B1D60_POSITION                                0x0
#define _B1D6_B1D60_SIZE                                    0x1
#define _B1D6_B1D60_LENGTH                                  0x1
#define _B1D6_B1D60_MASK                                    0x1
#define _B1D6_B1D61_POSN                                    0x1
#define _B1D6_B1D61_POSITION                                0x1
#define _B1D6_B1D61_SIZE                                    0x1
#define _B1D6_B1D61_LENGTH                                  0x1
#define _B1D6_B1D61_MASK                                    0x2
#define _B1D6_B1D62_POSN                                    0x2
#define _B1D6_B1D62_POSITION                                0x2
#define _B1D6_B1D62_SIZE                                    0x1
#define _B1D6_B1D62_LENGTH                                  0x1
#define _B1D6_B1D62_MASK                                    0x4
#define _B1D6_B1D63_POSN                                    0x3
#define _B1D6_B1D63_POSITION                                0x3
#define _B1D6_B1D63_SIZE                                    0x1
#define _B1D6_B1D63_LENGTH                                  0x1
#define _B1D6_B1D63_MASK                                    0x8
#define _B1D6_B1D64_POSN                                    0x4
#define _B1D6_B1D64_POSITION                                0x4
#define _B1D6_B1D64_SIZE                                    0x1
#define _B1D6_B1D64_LENGTH                                  0x1
#define _B1D6_B1D64_MASK                                    0x10
#define _B1D6_B1D65_POSN                                    0x5
#define _B1D6_B1D65_POSITION                                0x5
#define _B1D6_B1D65_SIZE                                    0x1
#define _B1D6_B1D65_LENGTH                                  0x1
#define _B1D6_B1D65_MASK                                    0x20
#define _B1D6_B1D66_POSN                                    0x6
#define _B1D6_B1D66_POSITION                                0x6
#define _B1D6_B1D66_SIZE                                    0x1
#define _B1D6_B1D66_LENGTH                                  0x1
#define _B1D6_B1D66_MASK                                    0x40
#define _B1D6_B1D67_POSN                                    0x7
#define _B1D6_B1D67_POSITION                                0x7
#define _B1D6_B1D67_SIZE                                    0x1
#define _B1D6_B1D67_LENGTH                                  0x1
#define _B1D6_B1D67_MASK                                    0x80

// Register: B1D7
#define B1D7 B1D7
extern volatile unsigned char           B1D7                __at(0xE9D);
#ifndef _LIB_BUILD
asm("B1D7 equ 0E9Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B1D7                   :8;
    };
    struct {
        unsigned B1D70                  :1;
        unsigned B1D71                  :1;
        unsigned B1D72                  :1;
        unsigned B1D73                  :1;
        unsigned B1D74                  :1;
        unsigned B1D75                  :1;
        unsigned B1D76                  :1;
        unsigned B1D77                  :1;
    };
} B1D7bits_t;
extern volatile B1D7bits_t B1D7bits __at(0xE9D);
// bitfield macros
#define _B1D7_B1D7_POSN                                     0x0
#define _B1D7_B1D7_POSITION                                 0x0
#define _B1D7_B1D7_SIZE                                     0x8
#define _B1D7_B1D7_LENGTH                                   0x8
#define _B1D7_B1D7_MASK                                     0xFF
#define _B1D7_B1D70_POSN                                    0x0
#define _B1D7_B1D70_POSITION                                0x0
#define _B1D7_B1D70_SIZE                                    0x1
#define _B1D7_B1D70_LENGTH                                  0x1
#define _B1D7_B1D70_MASK                                    0x1
#define _B1D7_B1D71_POSN                                    0x1
#define _B1D7_B1D71_POSITION                                0x1
#define _B1D7_B1D71_SIZE                                    0x1
#define _B1D7_B1D71_LENGTH                                  0x1
#define _B1D7_B1D71_MASK                                    0x2
#define _B1D7_B1D72_POSN                                    0x2
#define _B1D7_B1D72_POSITION                                0x2
#define _B1D7_B1D72_SIZE                                    0x1
#define _B1D7_B1D72_LENGTH                                  0x1
#define _B1D7_B1D72_MASK                                    0x4
#define _B1D7_B1D73_POSN                                    0x3
#define _B1D7_B1D73_POSITION                                0x3
#define _B1D7_B1D73_SIZE                                    0x1
#define _B1D7_B1D73_LENGTH                                  0x1
#define _B1D7_B1D73_MASK                                    0x8
#define _B1D7_B1D74_POSN                                    0x4
#define _B1D7_B1D74_POSITION                                0x4
#define _B1D7_B1D74_SIZE                                    0x1
#define _B1D7_B1D74_LENGTH                                  0x1
#define _B1D7_B1D74_MASK                                    0x10
#define _B1D7_B1D75_POSN                                    0x5
#define _B1D7_B1D75_POSITION                                0x5
#define _B1D7_B1D75_SIZE                                    0x1
#define _B1D7_B1D75_LENGTH                                  0x1
#define _B1D7_B1D75_MASK                                    0x20
#define _B1D7_B1D76_POSN                                    0x6
#define _B1D7_B1D76_POSITION                                0x6
#define _B1D7_B1D76_SIZE                                    0x1
#define _B1D7_B1D76_LENGTH                                  0x1
#define _B1D7_B1D76_MASK                                    0x40
#define _B1D7_B1D77_POSN                                    0x7
#define _B1D7_B1D77_POSITION                                0x7
#define _B1D7_B1D77_SIZE                                    0x1
#define _B1D7_B1D77_LENGTH                                  0x1
#define _B1D7_B1D77_MASK                                    0x80

