MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K80/mcu.h
// Register: TXB1D7
#define TXB1D7 TXB1D7
extern volatile unsigned char           TXB1D7              __at(0xF1D);
#ifndef _LIB_BUILD
asm("TXB1D7 equ 0F1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D7                 :8;
    };
    struct {
        unsigned TXB1D70                :1;
        unsigned TXB1D71                :1;
        unsigned TXB1D72                :1;
        unsigned TXB1D73                :1;
        unsigned TXB1D74                :1;
        unsigned TXB1D75                :1;
        unsigned TXB1D76                :1;
        unsigned TXB1D77                :1;
    };
} TXB1D7bits_t;
extern volatile TXB1D7bits_t TXB1D7bits __at(0xF1D);
// bitfield macros
#define _TXB1D7_TXB1D7_POSN                                 0x0
#define _TXB1D7_TXB1D7_POSITION                             0x0
#define _TXB1D7_TXB1D7_SIZE                                 0x8
#define _TXB1D7_TXB1D7_LENGTH                               0x8
#define _TXB1D7_TXB1D7_MASK                                 0xFF
#define _TXB1D7_TXB1D70_POSN                                0x0
#define _TXB1D7_TXB1D70_POSITION                            0x0
#define _TXB1D7_TXB1D70_SIZE                                0x1
#define _TXB1D7_TXB1D70_LENGTH                              0x1
#define _TXB1D7_TXB1D70_MASK                                0x1
#define _TXB1D7_TXB1D71_POSN                                0x1
#define _TXB1D7_TXB1D71_POSITION                            0x1
#define _TXB1D7_TXB1D71_SIZE                                0x1
#define _TXB1D7_TXB1D71_LENGTH                              0x1
#define _TXB1D7_TXB1D71_MASK                                0x2
#define _TXB1D7_TXB1D72_POSN                                0x2
#define _TXB1D7_TXB1D72_POSITION                            0x2
#define _TXB1D7_TXB1D72_SIZE                                0x1
#define _TXB1D7_TXB1D72_LENGTH                              0x1
#define _TXB1D7_TXB1D72_MASK                                0x4
#define _TXB1D7_TXB1D73_POSN                                0x3
#define _TXB1D7_TXB1D73_POSITION                            0x3
#define _TXB1D7_TXB1D73_SIZE                                0x1
#define _TXB1D7_TXB1D73_LENGTH                              0x1
#define _TXB1D7_TXB1D73_MASK                                0x8
#define _TXB1D7_TXB1D74_POSN                                0x4
#define _TXB1D7_TXB1D74_POSITION                            0x4
#define _TXB1D7_TXB1D74_SIZE                                0x1
#define _TXB1D7_TXB1D74_LENGTH                              0x1
#define _TXB1D7_TXB1D74_MASK                                0x10
#define _TXB1D7_TXB1D75_POSN                                0x5
#define _TXB1D7_TXB1D75_POSITION                            0x5
#define _TXB1D7_TXB1D75_SIZE                                0x1
#define _TXB1D7_TXB1D75_LENGTH                              0x1
#define _TXB1D7_TXB1D75_MASK                                0x20
#define _TXB1D7_TXB1D76_POSN                                0x6
#define _TXB1D7_TXB1D76_POSITION                            0x6
#define _TXB1D7_TXB1D76_SIZE                                0x1
#define _TXB1D7_TXB1D76_LENGTH                              0x1
#define _TXB1D7_TXB1D76_MASK                                0x40
#define _TXB1D7_TXB1D77_POSN                                0x7
#define _TXB1D7_TXB1D77_POSITION                            0x7
#define _TXB1D7_TXB1D77_SIZE                                0x1
#define _TXB1D7_TXB1D77_LENGTH                              0x1
#define _TXB1D7_TXB1D77_MASK                                0x80

// Register: CANSTAT_RO2
#define CANSTAT_RO2 CANSTAT_RO2
extern volatile unsigned char           CANSTAT_RO2         __at(0xF1E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO2 equ 0F1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE                 :3;
    };
    struct {
        unsigned                        :1;
        unsigned EICODE1                :1;
        unsigned EICODE2                :1;
        unsigned EICODE3                :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned                        :1;
        unsigned ICODE20                :1;
        unsigned ICODE21                :1;
        unsigned ICODE2                 :1;
    };
} CANSTAT_RO2bits_t;
extern volatile CANSTAT_RO2bits_t CANSTAT_RO2bits __at(0xF1E);
// bitfield macros
#define _CANSTAT_RO2_EICODE0_POSN                           0x0
#define _CANSTAT_RO2_EICODE0_POSITION                       0x0
#define _CANSTAT_RO2_EICODE0_SIZE                           0x1
#define _CANSTAT_RO2_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO2_EICODE0_MASK                           0x1
#define _CANSTAT_RO2_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO2_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO2_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO2_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO2_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO2_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO2_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO2_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO2_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO2_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO2_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO2_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO2_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO2_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO2_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO2_EICODE4_POSN                           0x4
#define _CANSTAT_RO2_EICODE4_POSITION                       0x4
#define _CANSTAT_RO2_EICODE4_SIZE                           0x1
#define _CANSTAT_RO2_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO2_EICODE4_MASK                           0x10
#define _CANSTAT_RO2_OPMODE_POSN                            0x5
#define _CANSTAT_RO2_OPMODE_POSITION                        0x5
#define _CANSTAT_RO2_OPMODE_SIZE                            0x3
#define _CANSTAT_RO2_OPMODE_LENGTH                          0x3
#define _CANSTAT_RO2_OPMODE_MASK                            0xE0
#define _CANSTAT_RO2_EICODE1_POSN                           0x1
#define _CANSTAT_RO2_EICODE1_POSITION                       0x1
#define _CANSTAT_RO2_EICODE1_SIZE                           0x1
#define _CANSTAT_RO2_EICODE1_LENGTH                         0x1
#define _CANSTAT_RO2_EICODE1_MASK                           0x2
#define _CANSTAT_RO2_EICODE2_POSN                           0x2
#define _CANSTAT_RO2_EICODE2_POSITION                       0x2
#define _CANSTAT_RO2_EICODE2_SIZE                           0x1
#define _CANSTAT_RO2_EICODE2_LENGTH                         0x1
#define _CANSTAT_RO2_EICODE2_MASK                           0x4
#define _CANSTAT_RO2_EICODE3_POSN                           0x3
#define _CANSTAT_RO2_EICODE3_POSITION                       0x3
#define _CANSTAT_RO2_EICODE3_SIZE                           0x1
#define _CANSTAT_RO2_EICODE3_LENGTH                         0x1
#define _CANSTAT_RO2_EICODE3_MASK                           0x8
#define _CANSTAT_RO2_OPMODE0_POSN                           0x5
#define _CANSTAT_RO2_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO2_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO2_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO2_OPMODE0_MASK                           0x20
#define _CANSTAT_RO2_OPMODE1_POSN                           0x6
#define _CANSTAT_RO2_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO2_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO2_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO2_OPMODE1_MASK                           0x40
#define _CANSTAT_RO2_OPMODE2_POSN                           0x7
#define _CANSTAT_RO2_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO2_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO2_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO2_OPMODE2_MASK                           0x80
#define _CANSTAT_RO2_ICODE20_POSN                           0x1
#define _CANSTAT_RO2_ICODE20_POSITION                       0x1
#define _CANSTAT_RO2_ICODE20_SIZE                           0x1
#define _CANSTAT_RO2_ICODE20_LENGTH                         0x1
#define _CANSTAT_RO2_ICODE20_MASK                           0x2
#define _CANSTAT_RO2_ICODE21_POSN                           0x2
#define _CANSTAT_RO2_ICODE21_POSITION                       0x2
#define _CANSTAT_RO2_ICODE21_SIZE                           0x1
#define _CANSTAT_RO2_ICODE21_LENGTH                         0x1
#define _CANSTAT_RO2_ICODE21_MASK                           0x4
#define _CANSTAT_RO2_ICODE2_POSN                            0x3
#define _CANSTAT_RO2_ICODE2_POSITION                        0x3
#define _CANSTAT_RO2_ICODE2_SIZE                            0x1
#define _CANSTAT_RO2_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO2_ICODE2_MASK                            0x8

// Register: CANCON_RO2
#define CANCON_RO2 CANCON_RO2
extern volatile unsigned char           CANCON_RO2          __at(0xF1F);
#ifndef _LIB_BUILD
asm("CANCON_RO2 equ 0F1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP                  :3;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned FP1                    :1;
        unsigned FP2                    :1;
        unsigned FP3                    :1;
    };
} CANCON_RO2bits_t;
