MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K80/mcu.h
extern volatile MDCARHbits_t MDCARHbits __at(0xF43);
// bitfield macros
#define _MDCARH_MDCH_POSN                                   0x0
#define _MDCARH_MDCH_POSITION                               0x0
#define _MDCARH_MDCH_SIZE                                   0x4
#define _MDCARH_MDCH_LENGTH                                 0x4
#define _MDCARH_MDCH_MASK                                   0xF
#define _MDCARH_MDCHSYNC_POSN                               0x5
#define _MDCARH_MDCHSYNC_POSITION                           0x5
#define _MDCARH_MDCHSYNC_SIZE                               0x1
#define _MDCARH_MDCHSYNC_LENGTH                             0x1
#define _MDCARH_MDCHSYNC_MASK                               0x20
#define _MDCARH_MDCHPOL_POSN                                0x6
#define _MDCARH_MDCHPOL_POSITION                            0x6
#define _MDCARH_MDCHPOL_SIZE                                0x1
#define _MDCARH_MDCHPOL_LENGTH                              0x1
#define _MDCARH_MDCHPOL_MASK                                0x40
#define _MDCARH_MDCHODIS_POSN                               0x7
#define _MDCARH_MDCHODIS_POSITION                           0x7
#define _MDCARH_MDCHODIS_SIZE                               0x1
#define _MDCARH_MDCHODIS_LENGTH                             0x1
#define _MDCARH_MDCHODIS_MASK                               0x80
#define _MDCARH_MDCH0_POSN                                  0x0
#define _MDCARH_MDCH0_POSITION                              0x0
#define _MDCARH_MDCH0_SIZE                                  0x1
#define _MDCARH_MDCH0_LENGTH                                0x1
#define _MDCARH_MDCH0_MASK                                  0x1
#define _MDCARH_MDCH1_POSN                                  0x1
#define _MDCARH_MDCH1_POSITION                              0x1
#define _MDCARH_MDCH1_SIZE                                  0x1
#define _MDCARH_MDCH1_LENGTH                                0x1
#define _MDCARH_MDCH1_MASK                                  0x2
#define _MDCARH_MDCH2_POSN                                  0x2
#define _MDCARH_MDCH2_POSITION                              0x2
#define _MDCARH_MDCH2_SIZE                                  0x1
#define _MDCARH_MDCH2_LENGTH                                0x1
#define _MDCARH_MDCH2_MASK                                  0x4
#define _MDCARH_MDCH3_POSN                                  0x3
#define _MDCARH_MDCH3_POSITION                              0x3
#define _MDCARH_MDCH3_SIZE                                  0x1
#define _MDCARH_MDCH3_LENGTH                                0x1
#define _MDCARH_MDCH3_MASK                                  0x8

// Register: MDSRC
#define MDSRC MDSRC
extern volatile unsigned char           MDSRC               __at(0xF44);
#ifndef _LIB_BUILD
asm("MDSRC equ 0F44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDSRC                  :4;
        unsigned                        :3;
        unsigned MDSODIS                :1;
    };
    struct {
        unsigned MDSRC0                 :1;
        unsigned MDSRC1                 :1;
        unsigned MDSRC2                 :1;
        unsigned MDSRC3                 :1;
    };
} MDSRCbits_t;
extern volatile MDSRCbits_t MDSRCbits __at(0xF44);
// bitfield macros
#define _MDSRC_MDSRC_POSN                                   0x0
#define _MDSRC_MDSRC_POSITION                               0x0
#define _MDSRC_MDSRC_SIZE                                   0x4
#define _MDSRC_MDSRC_LENGTH                                 0x4
#define _MDSRC_MDSRC_MASK                                   0xF
#define _MDSRC_MDSODIS_POSN                                 0x7
#define _MDSRC_MDSODIS_POSITION                             0x7
#define _MDSRC_MDSODIS_SIZE                                 0x1
#define _MDSRC_MDSODIS_LENGTH                               0x1
#define _MDSRC_MDSODIS_MASK                                 0x80
#define _MDSRC_MDSRC0_POSN                                  0x0
#define _MDSRC_MDSRC0_POSITION                              0x0
#define _MDSRC_MDSRC0_SIZE                                  0x1
#define _MDSRC_MDSRC0_LENGTH                                0x1
#define _MDSRC_MDSRC0_MASK                                  0x1
#define _MDSRC_MDSRC1_POSN                                  0x1
#define _MDSRC_MDSRC1_POSITION                              0x1
#define _MDSRC_MDSRC1_SIZE                                  0x1
#define _MDSRC_MDSRC1_LENGTH                                0x1
#define _MDSRC_MDSRC1_MASK                                  0x2
#define _MDSRC_MDSRC2_POSN                                  0x2
#define _MDSRC_MDSRC2_POSITION                              0x2
#define _MDSRC_MDSRC2_SIZE                                  0x1
#define _MDSRC_MDSRC2_LENGTH                                0x1
#define _MDSRC_MDSRC2_MASK                                  0x4
#define _MDSRC_MDSRC3_POSN                                  0x3
#define _MDSRC_MDSRC3_POSITION                              0x3
#define _MDSRC_MDSRC3_SIZE                                  0x1
#define _MDSRC_MDSRC3_LENGTH                                0x1
#define _MDSRC_MDSRC3_MASK                                  0x8

// Register: MDCON
#define MDCON MDCON
extern volatile unsigned char           MDCON               __at(0xF45);
#ifndef _LIB_BUILD
asm("MDCON equ 0F45h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDBIT                  :1;
        unsigned                        :2;
        unsigned MDO                    :1;
        unsigned MDOPOL                 :1;
        unsigned MDSLR                  :1;
        unsigned MDOE                   :1;
        unsigned MDEN                   :1;
    };
} MDCONbits_t;
extern volatile MDCONbits_t MDCONbits __at(0xF45);
// bitfield macros
#define _MDCON_MDBIT_POSN                                   0x0
#define _MDCON_MDBIT_POSITION                               0x0
#define _MDCON_MDBIT_SIZE                                   0x1
#define _MDCON_MDBIT_LENGTH                                 0x1
#define _MDCON_MDBIT_MASK                                   0x1
#define _MDCON_MDO_POSN                                     0x3
#define _MDCON_MDO_POSITION                                 0x3
#define _MDCON_MDO_SIZE                                     0x1
#define _MDCON_MDO_LENGTH                                   0x1
#define _MDCON_MDO_MASK                                     0x8
#define _MDCON_MDOPOL_POSN                                  0x4
#define _MDCON_MDOPOL_POSITION                              0x4
#define _MDCON_MDOPOL_SIZE                                  0x1
#define _MDCON_MDOPOL_LENGTH                                0x1
#define _MDCON_MDOPOL_MASK                                  0x10
#define _MDCON_MDSLR_POSN                                   0x5
#define _MDCON_MDSLR_POSITION                               0x5
#define _MDCON_MDSLR_SIZE                                   0x1
#define _MDCON_MDSLR_LENGTH                                 0x1
#define _MDCON_MDSLR_MASK                                   0x20
#define _MDCON_MDOE_POSN                                    0x6
#define _MDCON_MDOE_POSITION                                0x6
#define _MDCON_MDOE_SIZE                                    0x1
#define _MDCON_MDOE_LENGTH                                  0x1
#define _MDCON_MDOE_MASK                                    0x40
#define _MDCON_MDEN_POSN                                    0x7
#define _MDCON_MDEN_POSITION                                0x7
#define _MDCON_MDEN_SIZE                                    0x1
#define _MDCON_MDEN_LENGTH                                  0x1
#define _MDCON_MDEN_MASK                                    0x80

// Register: PSPCON
#define PSPCON PSPCON
extern volatile unsigned char           PSPCON              __at(0xF46);
#ifndef _LIB_BUILD
asm("PSPCON equ 0F46h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned PSPMODE                :1;
        unsigned IBOV                   :1;
        unsigned OBF                    :1;
        unsigned IBF                    :1;
    };
} PSPCONbits_t;
