MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K80/mcu.h
#define                                 B5FILHIT2_bit       _BIT_ACCESS(B5CON,2)
// B5CON<B5FILHIT3>
extern volatile __bit                   B5FILHIT3           __at(0x7683);	// @ (0xED0 * 8 + 3)
#define                                 B5FILHIT3_bit       _BIT_ACCESS(B5CON,3)
// B5CON<B5FILHIT4>
extern volatile __bit                   B5FILHIT4           __at(0x7684);	// @ (0xED0 * 8 + 4)
#define                                 B5FILHIT4_bit       _BIT_ACCESS(B5CON,4)
// BIE0<B5IE>
extern volatile __bit                   B5IE                __at(0x73F7);	// @ (0xE7E * 8 + 7)
#define                                 B5IE_bit            _BIT_ACCESS(BIE0,7)
// B5DLC<B5RB0>
extern volatile __bit                   B5RB0               __at(0x76AC);	// @ (0xED5 * 8 + 4)
#define                                 B5RB0_bit           _BIT_ACCESS(B5DLC,4)
// B5DLC<B5RB1>
extern volatile __bit                   B5RB1               __at(0x76AD);	// @ (0xED5 * 8 + 5)
#define                                 B5RB1_bit           _BIT_ACCESS(B5DLC,5)
// B5CON<B5RTREN>
extern volatile __bit                   B5RTREN             __at(0x7682);	// @ (0xED0 * 8 + 2)
#define                                 B5RTREN_bit         _BIT_ACCESS(B5CON,2)
// B5CON<B5RTRRO>
extern volatile __bit                   B5RTRRO             __at(0x7685);	// @ (0xED0 * 8 + 5)
#define                                 B5RTRRO_bit         _BIT_ACCESS(B5CON,5)
// B5CON<B5RXFUL>
extern volatile __bit                   B5RXFUL             __at(0x7687);	// @ (0xED0 * 8 + 7)
#define                                 B5RXFUL_bit         _BIT_ACCESS(B5CON,7)
// B5CON<B5RXM1>
extern volatile __bit                   B5RXM1              __at(0x7686);	// @ (0xED0 * 8 + 6)
#define                                 B5RXM1_bit          _BIT_ACCESS(B5CON,6)
// B5DLC<B5RXRTR>
extern volatile __bit                   B5RXRTR             __at(0x76AE);	// @ (0xED5 * 8 + 6)
#define                                 B5RXRTR_bit         _BIT_ACCESS(B5DLC,6)
// B5SIDL<B5SID0>
extern volatile __bit                   B5SID0              __at(0x7695);	// @ (0xED2 * 8 + 5)
#define                                 B5SID0_bit          _BIT_ACCESS(B5SIDL,5)
// B5SIDL<B5SID1>
extern volatile __bit                   B5SID1              __at(0x7696);	// @ (0xED2 * 8 + 6)
#define                                 B5SID1_bit          _BIT_ACCESS(B5SIDL,6)
// B5SIDH<B5SID10>
extern volatile __bit                   B5SID10             __at(0x768F);	// @ (0xED1 * 8 + 7)
#define                                 B5SID10_bit         _BIT_ACCESS(B5SIDH,7)
// B5SIDL<B5SID2>
extern volatile __bit                   B5SID2              __at(0x7697);	// @ (0xED2 * 8 + 7)
#define                                 B5SID2_bit          _BIT_ACCESS(B5SIDL,7)
// B5SIDH<B5SID3>
extern volatile __bit                   B5SID3              __at(0x7688);	// @ (0xED1 * 8 + 0)
#define                                 B5SID3_bit          _BIT_ACCESS(B5SIDH,0)
// B5SIDH<B5SID4>
extern volatile __bit                   B5SID4              __at(0x7689);	// @ (0xED1 * 8 + 1)
#define                                 B5SID4_bit          _BIT_ACCESS(B5SIDH,1)
// B5SIDH<B5SID5>
extern volatile __bit                   B5SID5              __at(0x768A);	// @ (0xED1 * 8 + 2)
#define                                 B5SID5_bit          _BIT_ACCESS(B5SIDH,2)
// B5SIDH<B5SID6>
extern volatile __bit                   B5SID6              __at(0x768B);	// @ (0xED1 * 8 + 3)
#define                                 B5SID6_bit          _BIT_ACCESS(B5SIDH,3)
// B5SIDH<B5SID7>
extern volatile __bit                   B5SID7              __at(0x768C);	// @ (0xED1 * 8 + 4)
#define                                 B5SID7_bit          _BIT_ACCESS(B5SIDH,4)
// B5SIDH<B5SID8>
extern volatile __bit                   B5SID8              __at(0x768D);	// @ (0xED1 * 8 + 5)
#define                                 B5SID8_bit          _BIT_ACCESS(B5SIDH,5)
// B5SIDH<B5SID9>
extern volatile __bit                   B5SID9              __at(0x768E);	// @ (0xED1 * 8 + 6)
#define                                 B5SID9_bit          _BIT_ACCESS(B5SIDH,6)
// B5SIDL<B5SRR>
extern volatile __bit                   B5SRR               __at(0x7694);	// @ (0xED2 * 8 + 4)
#define                                 B5SRR_bit           _BIT_ACCESS(B5SIDL,4)
// B5CON<B5TXABT>
extern volatile __bit                   B5TXABT             __at(0x7686);	// @ (0xED0 * 8 + 6)
#define                                 B5TXABT_bit         _BIT_ACCESS(B5CON,6)
// B5CON<B5TXBIF>
extern volatile __bit                   B5TXBIF             __at(0x7687);	// @ (0xED0 * 8 + 7)
#define                                 B5TXBIF_bit         _BIT_ACCESS(B5CON,7)
// BSEL0<B5TXEN>
extern volatile __bit                   B5TXEN              __at(0x73EF);	// @ (0xE7D * 8 + 7)
#define                                 B5TXEN_bit          _BIT_ACCESS(BSEL0,7)
// B5CON<B5TXERR>
extern volatile __bit                   B5TXERR             __at(0x7684);	// @ (0xED0 * 8 + 4)
#define                                 B5TXERR_bit         _BIT_ACCESS(B5CON,4)
// B5CON<B5TXLARB>
extern volatile __bit                   B5TXLARB            __at(0x7685);	// @ (0xED0 * 8 + 5)
#define                                 B5TXLARB_bit        _BIT_ACCESS(B5CON,5)
// B5CON<B5TXPRI0>
extern volatile __bit                   B5TXPRI0            __at(0x7680);	// @ (0xED0 * 8 + 0)
#define                                 B5TXPRI0_bit        _BIT_ACCESS(B5CON,0)
// B5CON<B5TXPRI1>
extern volatile __bit                   B5TXPRI1            __at(0x7681);	// @ (0xED0 * 8 + 1)
#define                                 B5TXPRI1_bit        _BIT_ACCESS(B5CON,1)
// B5CON<B5TXREQ>
extern volatile __bit                   B5TXREQ             __at(0x7683);	// @ (0xED0 * 8 + 3)
#define                                 B5TXREQ_bit         _BIT_ACCESS(B5CON,3)
// PIE2<BCLIE>
extern volatile __bit                   BCLIE               __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCLIE_bit           _BIT_ACCESS(PIE2,3)
// PIR2<BCLIF>
extern volatile __bit                   BCLIF               __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCLIF_bit           _BIT_ACCESS(PIR2,3)
// IPR2<BCLIP>
extern volatile __bit                   BCLIP               __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCLIP_bit           _BIT_ACCESS(IPR2,3)
// SSPSTAT<BF>
extern volatile __bit                   BF                  __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSPSTAT,0)
// HLVDCON<BGVST>
extern volatile __bit                   BGVST               __at(0x7D46);	// @ (0xFA8 * 8 + 6)
#define                                 BGVST_bit           _BIT_ACCESS(HLVDCON,6)
// RCON<BOR>
extern volatile __bit                   BOR                 __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(RCON,0)
// BAUDCON1<BRG161>
extern volatile __bit                   BRG161              __at(0x7D3B);	// @ (0xFA7 * 8 + 3)
#define                                 BRG161_bit          _BIT_ACCESS(BAUDCON1,3)
// BAUDCON2<BRG162>
extern volatile __bit                   BRG162              __at(0x7DCB);	// @ (0xFB9 * 8 + 3)
#define                                 BRG162_bit          _BIT_ACCESS(BAUDCON2,3)
// TXSTA1<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TXSTA1,2)
// TXSTA2<BRGH2>
extern volatile __bit                   BRGH2               __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 BRGH2_bit           _BIT_ACCESS(TXSTA2,2)
// BRGCON1<BRP0>
extern volatile __bit                   BRP0                __at(0x7218);	// @ (0xE43 * 8 + 0)
#define                                 BRP0_bit            _BIT_ACCESS(BRGCON1,0)
// BRGCON1<BRP1>
extern volatile __bit                   BRP1                __at(0x7219);	// @ (0xE43 * 8 + 1)
#define                                 BRP1_bit            _BIT_ACCESS(BRGCON1,1)
// BRGCON1<BRP2>
extern volatile __bit                   BRP2                __at(0x721A);	// @ (0xE43 * 8 + 2)
#define                                 BRP2_bit            _BIT_ACCESS(BRGCON1,2)
// BRGCON1<BRP3>
extern volatile __bit                   BRP3                __at(0x721B);	// @ (0xE43 * 8 + 3)
#define                                 BRP3_bit            _BIT_ACCESS(BRGCON1,3)
// BRGCON1<BRP4>
extern volatile __bit                   BRP4                __at(0x721C);	// @ (0xE43 * 8 + 4)
#define                                 BRP4_bit            _BIT_ACCESS(BRGCON1,4)
// BRGCON1<BRP5>
extern volatile __bit                   BRP5                __at(0x721D);	// @ (0xE43 * 8 + 5)
#define                                 BRP5_bit            _BIT_ACCESS(BRGCON1,5)
// CM1CON<C1CH0>
extern volatile __bit                   C1CH0               __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 C1CH0_bit           _BIT_ACCESS(CM1CON,0)
// CM1CON<C1CH1>
extern volatile __bit                   C1CH1               __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 C1CH1_bit           _BIT_ACCESS(CM1CON,1)
// PORTF<C1OUTF>
extern volatile __bit                   C1OUTF              __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 C1OUTF_bit          _BIT_ACCESS(PORTF,2)
// CCPTMRS<C1TSEL>
extern volatile __bit                   C1TSEL              __at(0x7CC8);	// @ (0xF99 * 8 + 0)
#define                                 C1TSEL_bit          _BIT_ACCESS(CCPTMRS,0)
// CMSTAT<C2OUT>
extern volatile __bit                   C2OUT               __at(0x7DA6);	// @ (0xFB4 * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CMSTAT,6)
// PORTF<C2OUTF>
extern volatile __bit                   C2OUTF              __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 C2OUTF_bit          _BIT_ACCESS(PORTF,1)
// CCPTMRS<C2TSEL>
extern volatile __bit                   C2TSEL              __at(0x7CC9);	// @ (0xF99 * 8 + 1)
#define                                 C2TSEL_bit          _BIT_ACCESS(CCPTMRS,1)
// CMSTAT<C3OUT>
extern volatile __bit                   C3OUT               __at(0x7DA7);	// @ (0xFB4 * 8 + 7)
#define                                 C3OUT_bit           _BIT_ACCESS(CMSTAT,7)
// PORTG<C3OUTG>
extern volatile __bit                   C3OUTG              __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 C3OUTG_bit          _BIT_ACCESS(PORTG,1)
// CCPTMRS<C3TSEL>
extern volatile __bit                   C3TSEL              __at(0x7CCA);	// @ (0xF99 * 8 + 2)
#define                                 C3TSEL_bit          _BIT_ACCESS(CCPTMRS,2)
// CCPTMRS<C4TSEL>
extern volatile __bit                   C4TSEL              __at(0x7CCB);	// @ (0xF99 * 8 + 3)
#define                                 C4TSEL_bit          _BIT_ACCESS(CCPTMRS,3)
// CCPTMRS<C5TSEL>
extern volatile __bit                   C5TSEL              __at(0x7CCC);	// @ (0xF99 * 8 + 4)
#define                                 C5TSEL_bit          _BIT_ACCESS(CCPTMRS,4)
// CIOCON<CANCAP>
extern volatile __bit                   CANCAP              __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 CANCAP_bit          _BIT_ACCESS(CIOCON,4)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CM1CON<CCH01>
extern volatile __bit                   CCH01               __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 CCH01_bit           _BIT_ACCESS(CM1CON,0)
// CM2CON<CCH02>
extern volatile __bit                   CCH02               __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 CCH02_bit           _BIT_ACCESS(CM2CON,0)
// IPR5<CCH05>
extern volatile __bit                   CCH05               __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 CCH05_bit           _BIT_ACCESS(IPR5,0)
// CM1CON<CCH11>
extern volatile __bit                   CCH11               __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 CCH11_bit           _BIT_ACCESS(CM1CON,1)
// CM2CON<CCH12>
extern volatile __bit                   CCH12               __at(0x7AF1);	// @ (0xF5E * 8 + 1)
#define                                 CCH12_bit           _BIT_ACCESS(CM2CON,1)
// IPR5<CCH15>
extern volatile __bit                   CCH15               __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 CCH15_bit           _BIT_ACCESS(IPR5,1)
// IPR4<CCIP3IP>
extern volatile __bit                   CCIP3IP             __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 CCIP3IP_bit         _BIT_ACCESS(IPR4,0)
// PORTE<CCP10>
extern volatile __bit                   CCP10               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CCP10_bit           _BIT_ACCESS(PORTE,2)
// PIE3<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR3,1)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DD8);	// @ (0xFBB * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DD9);	// @ (0xFBB * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DDA);	// @ (0xFBB * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DDB);	// @ (0xFBB * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// PMD0<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x7ACB);	// @ (0xF59 * 8 + 3)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD0,3)
// ODCON<CCP1OD>
extern volatile __bit                   CCP1OD              __at(0x7C8A);	// @ (0xF91 * 8 + 2)
#define                                 CCP1OD_bit          _BIT_ACCESS(ODCON,2)
// CCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0x7DDD);	// @ (0xFBB * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(CCP1CON,5)
// CCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0x7DDC);	// @ (0xFBB * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// PORTE<CCP2E>
extern volatile __bit                   CCP2E               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 CCP2E_bit           _BIT_ACCESS(PORTE,7)
// PIE3<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D22);	// @ (0xFA4 * 8 + 2)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D2A);	// @ (0xFA5 * 8 + 2)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR3,2)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7A80);	// @ (0xF50 * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7A81);	// @ (0xF50 * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7A82);	// @ (0xF50 * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7A83);	// @ (0xF50 * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// PMD0<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x7ACC);	// @ (0xF59 * 8 + 4)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD0,4)
// ODCON<CCP2OD>
extern volatile __bit                   CCP2OD              __at(0x7C8B);	// @ (0xF91 * 8 + 3)
#define                                 CCP2OD_bit          _BIT_ACCESS(ODCON,3)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x7A85);	// @ (0xF50 * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x7A84);	// @ (0xF50 * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PIE4<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x7DB0);	// @ (0xFB6 * 8 + 0)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x7DB8);	// @ (0xFB7 * 8 + 0)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 CCP3IP_bit          _BIT_ACCESS(IPR4,0)
// CCP3CON<CCP3M0>
extern volatile __bit                   CCP3M0              __at(0x7A68);	// @ (0xF4D * 8 + 0)
#define                                 CCP3M0_bit          _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3M1>
extern volatile __bit                   CCP3M1              __at(0x7A69);	// @ (0xF4D * 8 + 1)
#define                                 CCP3M1_bit          _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3M2>
extern volatile __bit                   CCP3M2              __at(0x7A6A);	// @ (0xF4D * 8 + 2)
#define                                 CCP3M2_bit          _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3M3>
extern volatile __bit                   CCP3M3              __at(0x7A6B);	// @ (0xF4D * 8 + 3)
#define                                 CCP3M3_bit          _BIT_ACCESS(CCP3CON,3)
// PMD0<CCP3MD>
extern volatile __bit                   CCP3MD              __at(0x7ACD);	// @ (0xF59 * 8 + 5)
#define                                 CCP3MD_bit          _BIT_ACCESS(PMD0,5)
// ODCON<CCP3OD>
extern volatile __bit                   CCP3OD              __at(0x7C8C);	// @ (0xF91 * 8 + 4)
#define                                 CCP3OD_bit          _BIT_ACCESS(ODCON,4)
// CCP3CON<CCP3X>
extern volatile __bit                   CCP3X               __at(0x7A6D);	// @ (0xF4D * 8 + 5)
#define                                 CCP3X_bit           _BIT_ACCESS(CCP3CON,5)
// CCP3CON<CCP3Y>
extern volatile __bit                   CCP3Y               __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 CCP3Y_bit           _BIT_ACCESS(CCP3CON,4)
// PIE4<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x7DB1);	// @ (0xFB6 * 8 + 1)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x7DB9);	// @ (0xFB7 * 8 + 1)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR4,1)
// IPR4<CCP4IP>
extern volatile __bit                   CCP4IP              __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 CCP4IP_bit          _BIT_ACCESS(IPR4,1)
// CCP4CON<CCP4M0>
extern volatile __bit                   CCP4M0              __at(0x7A50);	// @ (0xF4A * 8 + 0)
#define                                 CCP4M0_bit          _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4M1>
extern volatile __bit                   CCP4M1              __at(0x7A51);	// @ (0xF4A * 8 + 1)
#define                                 CCP4M1_bit          _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4M2>
extern volatile __bit                   CCP4M2              __at(0x7A52);	// @ (0xF4A * 8 + 2)
#define                                 CCP4M2_bit          _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4M3>
extern volatile __bit                   CCP4M3              __at(0x7A53);	// @ (0xF4A * 8 + 3)
#define                                 CCP4M3_bit          _BIT_ACCESS(CCP4CON,3)
// PMD0<CCP4MD>
extern volatile __bit                   CCP4MD              __at(0x7ACE);	// @ (0xF59 * 8 + 6)
#define                                 CCP4MD_bit          _BIT_ACCESS(PMD0,6)
// ODCON<CCP4OD>
extern volatile __bit                   CCP4OD              __at(0x7C8D);	// @ (0xF91 * 8 + 5)
#define                                 CCP4OD_bit          _BIT_ACCESS(ODCON,5)
// CCP4CON<CCP4X>
extern volatile __bit                   CCP4X               __at(0x7A55);	// @ (0xF4A * 8 + 5)
#define                                 CCP4X_bit           _BIT_ACCESS(CCP4CON,5)
// CCP4CON<CCP4Y>
extern volatile __bit                   CCP4Y               __at(0x7A54);	// @ (0xF4A * 8 + 4)
#define                                 CCP4Y_bit           _BIT_ACCESS(CCP4CON,4)
// PIE4<CCP5IE>
extern volatile __bit                   CCP5IE              __at(0x7DB2);	// @ (0xFB6 * 8 + 2)
#define                                 CCP5IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<CCP5IF>
extern volatile __bit                   CCP5IF              __at(0x7DBA);	// @ (0xFB7 * 8 + 2)
#define                                 CCP5IF_bit          _BIT_ACCESS(PIR4,2)
// IPR4<CCP5IP>
extern volatile __bit                   CCP5IP              __at(0x7DC2);	// @ (0xFB8 * 8 + 2)
#define                                 CCP5IP_bit          _BIT_ACCESS(IPR4,2)
// CCP5CON<CCP5M0>
extern volatile __bit                   CCP5M0              __at(0x7A38);	// @ (0xF47 * 8 + 0)
#define                                 CCP5M0_bit          _BIT_ACCESS(CCP5CON,0)
// CCP5CON<CCP5M1>
extern volatile __bit                   CCP5M1              __at(0x7A39);	// @ (0xF47 * 8 + 1)
#define                                 CCP5M1_bit          _BIT_ACCESS(CCP5CON,1)
// CCP5CON<CCP5M2>
extern volatile __bit                   CCP5M2              __at(0x7A3A);	// @ (0xF47 * 8 + 2)
#define                                 CCP5M2_bit          _BIT_ACCESS(CCP5CON,2)
// CCP5CON<CCP5M3>
extern volatile __bit                   CCP5M3              __at(0x7A3B);	// @ (0xF47 * 8 + 3)
#define                                 CCP5M3_bit          _BIT_ACCESS(CCP5CON,3)
// PMD0<CCP5MD>
extern volatile __bit                   CCP5MD              __at(0x7ACF);	// @ (0xF59 * 8 + 7)
#define                                 CCP5MD_bit          _BIT_ACCESS(PMD0,7)
// ODCON<CCP5OD>
