MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K80/mcu.h
#define                                 RE4_bit             _BIT_ACCESS(PORTE,4)
// PORTE<RE5>
extern volatile __bit                   RE5                 __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 RE5_bit             _BIT_ACCESS(PORTE,5)
// PORTE<RE6>
extern volatile __bit                   RE6                 __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 RE6_bit             _BIT_ACCESS(PORTE,6)
// PORTE<RE7>
extern volatile __bit                   RE7                 __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 RE7_bit             _BIT_ACCESS(PORTE,7)
// SSPSTAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSPSTAT,2)
// RXERRCNT<REC0>
extern volatile __bit                   REC0                __at(0x7208);	// @ (0xE41 * 8 + 0)
#define                                 REC0_bit            _BIT_ACCESS(RXERRCNT,0)
// RXERRCNT<REC1>
extern volatile __bit                   REC1                __at(0x7209);	// @ (0xE41 * 8 + 1)
#define                                 REC1_bit            _BIT_ACCESS(RXERRCNT,1)
// RXERRCNT<REC2>
extern volatile __bit                   REC2                __at(0x720A);	// @ (0xE41 * 8 + 2)
#define                                 REC2_bit            _BIT_ACCESS(RXERRCNT,2)
// RXERRCNT<REC3>
extern volatile __bit                   REC3                __at(0x720B);	// @ (0xE41 * 8 + 3)
#define                                 REC3_bit            _BIT_ACCESS(RXERRCNT,3)
// RXERRCNT<REC4>
extern volatile __bit                   REC4                __at(0x720C);	// @ (0xE41 * 8 + 4)
#define                                 REC4_bit            _BIT_ACCESS(RXERRCNT,4)
// RXERRCNT<REC5>
extern volatile __bit                   REC5                __at(0x720D);	// @ (0xE41 * 8 + 5)
#define                                 REC5_bit            _BIT_ACCESS(RXERRCNT,5)
// RXERRCNT<REC6>
extern volatile __bit                   REC6                __at(0x720E);	// @ (0xE41 * 8 + 6)
#define                                 REC6_bit            _BIT_ACCESS(RXERRCNT,6)
// RXERRCNT<REC7>
extern volatile __bit                   REC7                __at(0x720F);	// @ (0xE41 * 8 + 7)
#define                                 REC7_bit            _BIT_ACCESS(RXERRCNT,7)
// WDTCON<REGSLP>
extern volatile __bit                   REGSLP              __at(0x7E8F);	// @ (0xFD1 * 8 + 7)
#define                                 REGSLP_bit          _BIT_ACCESS(WDTCON,7)
// PADCFG1<REPU>
extern volatile __bit                   REPU                __at(0x7AB6);	// @ (0xF56 * 8 + 6)
#define                                 REPU_bit            _BIT_ACCESS(PADCFG1,6)
// PORTF<RF0>
extern volatile __bit                   RF0                 __at(0x7C28);	// @ (0xF85 * 8 + 0)
#define                                 RF0_bit             _BIT_ACCESS(PORTF,0)
// PORTF<RF1>
extern volatile __bit                   RF1                 __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 RF1_bit             _BIT_ACCESS(PORTF,1)
// PORTF<RF2>
extern volatile __bit                   RF2                 __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 RF2_bit             _BIT_ACCESS(PORTF,2)
// PORTF<RF3>
extern volatile __bit                   RF3                 __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 RF3_bit             _BIT_ACCESS(PORTF,3)
// PORTF<RF4>
extern volatile __bit                   RF4                 __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 RF4_bit             _BIT_ACCESS(PORTF,4)
// PORTF<RF5>
extern volatile __bit                   RF5                 __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 RF5_bit             _BIT_ACCESS(PORTF,5)
// PORTF<RF6>
extern volatile __bit                   RF6                 __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 RF6_bit             _BIT_ACCESS(PORTF,6)
// PORTF<RF7>
extern volatile __bit                   RF7                 __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 RF7_bit             _BIT_ACCESS(PORTF,7)
// PADCFG1<RFPU>
extern volatile __bit                   RFPU                __at(0x7AB5);	// @ (0xF56 * 8 + 5)
#define                                 RFPU_bit            _BIT_ACCESS(PADCFG1,5)
// PORTG<RG0>
extern volatile __bit                   RG0                 __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 RG0_bit             _BIT_ACCESS(PORTG,0)
// PORTG<RG1>
extern volatile __bit                   RG1                 __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 RG1_bit             _BIT_ACCESS(PORTG,1)
// PORTG<RG2>
extern volatile __bit                   RG2                 __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 RG2_bit             _BIT_ACCESS(PORTG,2)
// PORTG<RG3>
extern volatile __bit                   RG3                 __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 RG3_bit             _BIT_ACCESS(PORTG,3)
// PORTG<RG4>
extern volatile __bit                   RG4                 __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 RG4_bit             _BIT_ACCESS(PORTG,4)
// PADCFG1<RGPU>
extern volatile __bit                   RGPU                __at(0x7AB4);	// @ (0xF56 * 8 + 4)
#define                                 RGPU_bit            _BIT_ACCESS(PADCFG1,4)
// RCON<RI>
extern volatile __bit                   RI                  __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 RI_bit              _BIT_ACCESS(RCON,4)
// PORTA<RJPU>
extern volatile __bit                   RJPU                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RJPU_bit            _BIT_ACCESS(PORTA,7)
// REFOCON<RODIV0>
extern volatile __bit                   RODIV0              __at(0x7CD0);	// @ (0xF9A * 8 + 0)
#define                                 RODIV0_bit          _BIT_ACCESS(REFOCON,0)
// REFOCON<RODIV1>
extern volatile __bit                   RODIV1              __at(0x7CD1);	// @ (0xF9A * 8 + 1)
#define                                 RODIV1_bit          _BIT_ACCESS(REFOCON,1)
// REFOCON<RODIV2>
extern volatile __bit                   RODIV2              __at(0x7CD2);	// @ (0xF9A * 8 + 2)
#define                                 RODIV2_bit          _BIT_ACCESS(REFOCON,2)
// REFOCON<RODIV3>
extern volatile __bit                   RODIV3              __at(0x7CD3);	// @ (0xF9A * 8 + 3)
#define                                 RODIV3_bit          _BIT_ACCESS(REFOCON,3)
// REFOCON<ROON>
extern volatile __bit                   ROON                __at(0x7CD7);	// @ (0xF9A * 8 + 7)
#define                                 ROON_bit            _BIT_ACCESS(REFOCON,7)
// REFOCON<ROSEL>
extern volatile __bit                   ROSEL               __at(0x7CD4);	// @ (0xF9A * 8 + 4)
#define                                 ROSEL_bit           _BIT_ACCESS(REFOCON,4)
// REFOCON<ROSSLP>
extern volatile __bit                   ROSSLP              __at(0x7CD5);	// @ (0xF9A * 8 + 5)
#define                                 ROSSLP_bit          _BIT_ACCESS(REFOCON,5)
// SSPCON2<RSEN>
extern volatile __bit                   RSEN                __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSPCON2,1)
// SSPSTAT<RW>
extern volatile __bit                   RW                  __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSPSTAT,2)
// RCSTA1<RX91>
extern volatile __bit                   RX91                __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RX91_bit            _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RX92>
extern volatile __bit                   RX92                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 RX92_bit            _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RX9D1>
extern volatile __bit                   RX9D1               __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 RX9D1_bit           _BIT_ACCESS(RCSTA1,0)
// RCSTA2<RX9D2>
extern volatile __bit                   RX9D2               __at(0x7D30);	// @ (0xFA6 * 8 + 0)
#define                                 RX9D2_bit           _BIT_ACCESS(RCSTA2,0)
// RXB0D0<RXB0D00>
extern volatile __bit                   RXB0D00             __at(0x7B30);	// @ (0xF66 * 8 + 0)
#define                                 RXB0D00_bit         _BIT_ACCESS(RXB0D0,0)
// RXB0D0<RXB0D01>
extern volatile __bit                   RXB0D01             __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 RXB0D01_bit         _BIT_ACCESS(RXB0D0,1)
// RXB0D0<RXB0D02>
extern volatile __bit                   RXB0D02             __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 RXB0D02_bit         _BIT_ACCESS(RXB0D0,2)
// RXB0D0<RXB0D03>
extern volatile __bit                   RXB0D03             __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 RXB0D03_bit         _BIT_ACCESS(RXB0D0,3)
// RXB0D0<RXB0D04>
extern volatile __bit                   RXB0D04             __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 RXB0D04_bit         _BIT_ACCESS(RXB0D0,4)
// RXB0D0<RXB0D05>
extern volatile __bit                   RXB0D05             __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 RXB0D05_bit         _BIT_ACCESS(RXB0D0,5)
// RXB0D0<RXB0D06>
extern volatile __bit                   RXB0D06             __at(0x7B36);	// @ (0xF66 * 8 + 6)
#define                                 RXB0D06_bit         _BIT_ACCESS(RXB0D0,6)
// RXB0D0<RXB0D07>
extern volatile __bit                   RXB0D07             __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 RXB0D07_bit         _BIT_ACCESS(RXB0D0,7)
// RXB0D1<RXB0D10>
extern volatile __bit                   RXB0D10             __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 RXB0D10_bit         _BIT_ACCESS(RXB0D1,0)
// RXB0D1<RXB0D11>
extern volatile __bit                   RXB0D11             __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 RXB0D11_bit         _BIT_ACCESS(RXB0D1,1)
// RXB0D1<RXB0D12>
extern volatile __bit                   RXB0D12             __at(0x7B3A);	// @ (0xF67 * 8 + 2)
#define                                 RXB0D12_bit         _BIT_ACCESS(RXB0D1,2)
// RXB0D1<RXB0D13>
extern volatile __bit                   RXB0D13             __at(0x7B3B);	// @ (0xF67 * 8 + 3)
#define                                 RXB0D13_bit         _BIT_ACCESS(RXB0D1,3)
// RXB0D1<RXB0D14>
extern volatile __bit                   RXB0D14             __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 RXB0D14_bit         _BIT_ACCESS(RXB0D1,4)
// RXB0D1<RXB0D15>
extern volatile __bit                   RXB0D15             __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 RXB0D15_bit         _BIT_ACCESS(RXB0D1,5)
// RXB0D1<RXB0D16>
extern volatile __bit                   RXB0D16             __at(0x7B3E);	// @ (0xF67 * 8 + 6)
#define                                 RXB0D16_bit         _BIT_ACCESS(RXB0D1,6)
// RXB0D1<RXB0D17>
extern volatile __bit                   RXB0D17             __at(0x7B3F);	// @ (0xF67 * 8 + 7)
#define                                 RXB0D17_bit         _BIT_ACCESS(RXB0D1,7)
// RXB0D2<RXB0D20>
extern volatile __bit                   RXB0D20             __at(0x7B40);	// @ (0xF68 * 8 + 0)
#define                                 RXB0D20_bit         _BIT_ACCESS(RXB0D2,0)
// RXB0D2<RXB0D21>
extern volatile __bit                   RXB0D21             __at(0x7B41);	// @ (0xF68 * 8 + 1)
#define                                 RXB0D21_bit         _BIT_ACCESS(RXB0D2,1)
// RXB0D2<RXB0D22>
extern volatile __bit                   RXB0D22             __at(0x7B42);	// @ (0xF68 * 8 + 2)
#define                                 RXB0D22_bit         _BIT_ACCESS(RXB0D2,2)
// RXB0D2<RXB0D23>
extern volatile __bit                   RXB0D23             __at(0x7B43);	// @ (0xF68 * 8 + 3)
#define                                 RXB0D23_bit         _BIT_ACCESS(RXB0D2,3)
// RXB0D2<RXB0D24>
extern volatile __bit                   RXB0D24             __at(0x7B44);	// @ (0xF68 * 8 + 4)
#define                                 RXB0D24_bit         _BIT_ACCESS(RXB0D2,4)
// RXB0D2<RXB0D25>
extern volatile __bit                   RXB0D25             __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 RXB0D25_bit         _BIT_ACCESS(RXB0D2,5)
// RXB0D2<RXB0D26>
extern volatile __bit                   RXB0D26             __at(0x7B46);	// @ (0xF68 * 8 + 6)
#define                                 RXB0D26_bit         _BIT_ACCESS(RXB0D2,6)
// RXB0D2<RXB0D27>
extern volatile __bit                   RXB0D27             __at(0x7B47);	// @ (0xF68 * 8 + 7)
#define                                 RXB0D27_bit         _BIT_ACCESS(RXB0D2,7)
// RXB0D3<RXB0D30>
extern volatile __bit                   RXB0D30             __at(0x7B48);	// @ (0xF69 * 8 + 0)
#define                                 RXB0D30_bit         _BIT_ACCESS(RXB0D3,0)
// RXB0D3<RXB0D31>
extern volatile __bit                   RXB0D31             __at(0x7B49);	// @ (0xF69 * 8 + 1)
#define                                 RXB0D31_bit         _BIT_ACCESS(RXB0D3,1)
// RXB0D3<RXB0D32>
extern volatile __bit                   RXB0D32             __at(0x7B4A);	// @ (0xF69 * 8 + 2)
#define                                 RXB0D32_bit         _BIT_ACCESS(RXB0D3,2)
// RXB0D3<RXB0D33>
extern volatile __bit                   RXB0D33             __at(0x7B4B);	// @ (0xF69 * 8 + 3)
#define                                 RXB0D33_bit         _BIT_ACCESS(RXB0D3,3)
// RXB0D3<RXB0D34>
extern volatile __bit                   RXB0D34             __at(0x7B4C);	// @ (0xF69 * 8 + 4)
#define                                 RXB0D34_bit         _BIT_ACCESS(RXB0D3,4)
// RXB0D3<RXB0D35>
extern volatile __bit                   RXB0D35             __at(0x7B4D);	// @ (0xF69 * 8 + 5)
#define                                 RXB0D35_bit         _BIT_ACCESS(RXB0D3,5)
// RXB0D3<RXB0D36>
extern volatile __bit                   RXB0D36             __at(0x7B4E);	// @ (0xF69 * 8 + 6)
#define                                 RXB0D36_bit         _BIT_ACCESS(RXB0D3,6)
// RXB0D3<RXB0D37>
extern volatile __bit                   RXB0D37             __at(0x7B4F);	// @ (0xF69 * 8 + 7)
#define                                 RXB0D37_bit         _BIT_ACCESS(RXB0D3,7)
// RXB0D4<RXB0D40>
extern volatile __bit                   RXB0D40             __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 RXB0D40_bit         _BIT_ACCESS(RXB0D4,0)
// RXB0D4<RXB0D41>
extern volatile __bit                   RXB0D41             __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 RXB0D41_bit         _BIT_ACCESS(RXB0D4,1)
// RXB0D4<RXB0D42>
extern volatile __bit                   RXB0D42             __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 RXB0D42_bit         _BIT_ACCESS(RXB0D4,2)
// RXB0D4<RXB0D43>
extern volatile __bit                   RXB0D43             __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 RXB0D43_bit         _BIT_ACCESS(RXB0D4,3)
// RXB0D4<RXB0D44>
extern volatile __bit                   RXB0D44             __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 RXB0D44_bit         _BIT_ACCESS(RXB0D4,4)
// RXB0D4<RXB0D45>
extern volatile __bit                   RXB0D45             __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 RXB0D45_bit         _BIT_ACCESS(RXB0D4,5)
// RXB0D4<RXB0D46>
extern volatile __bit                   RXB0D46             __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 RXB0D46_bit         _BIT_ACCESS(RXB0D4,6)
// RXB0D4<RXB0D47>
extern volatile __bit                   RXB0D47             __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 RXB0D47_bit         _BIT_ACCESS(RXB0D4,7)
// RXB0D5<RXB0D50>
extern volatile __bit                   RXB0D50             __at(0x7B58);	// @ (0xF6B * 8 + 0)
#define                                 RXB0D50_bit         _BIT_ACCESS(RXB0D5,0)
// RXB0D5<RXB0D51>
extern volatile __bit                   RXB0D51             __at(0x7B59);	// @ (0xF6B * 8 + 1)
#define                                 RXB0D51_bit         _BIT_ACCESS(RXB0D5,1)
// RXB0D5<RXB0D52>
extern volatile __bit                   RXB0D52             __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 RXB0D52_bit         _BIT_ACCESS(RXB0D5,2)
// RXB0D5<RXB0D53>
extern volatile __bit                   RXB0D53             __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 RXB0D53_bit         _BIT_ACCESS(RXB0D5,3)
// RXB0D5<RXB0D54>
extern volatile __bit                   RXB0D54             __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 RXB0D54_bit         _BIT_ACCESS(RXB0D5,4)
// RXB0D5<RXB0D55>
extern volatile __bit                   RXB0D55             __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 RXB0D55_bit         _BIT_ACCESS(RXB0D5,5)
// RXB0D5<RXB0D56>
extern volatile __bit                   RXB0D56             __at(0x7B5E);	// @ (0xF6B * 8 + 6)
#define                                 RXB0D56_bit         _BIT_ACCESS(RXB0D5,6)
// RXB0D5<RXB0D57>
extern volatile __bit                   RXB0D57             __at(0x7B5F);	// @ (0xF6B * 8 + 7)
#define                                 RXB0D57_bit         _BIT_ACCESS(RXB0D5,7)
// RXB0D6<RXB0D60>
extern volatile __bit                   RXB0D60             __at(0x7B60);	// @ (0xF6C * 8 + 0)
#define                                 RXB0D60_bit         _BIT_ACCESS(RXB0D6,0)
// RXB0D6<RXB0D61>
extern volatile __bit                   RXB0D61             __at(0x7B61);	// @ (0xF6C * 8 + 1)
#define                                 RXB0D61_bit         _BIT_ACCESS(RXB0D6,1)
// RXB0D6<RXB0D62>
extern volatile __bit                   RXB0D62             __at(0x7B62);	// @ (0xF6C * 8 + 2)
#define                                 RXB0D62_bit         _BIT_ACCESS(RXB0D6,2)
// RXB0D6<RXB0D63>
extern volatile __bit                   RXB0D63             __at(0x7B63);	// @ (0xF6C * 8 + 3)
#define                                 RXB0D63_bit         _BIT_ACCESS(RXB0D6,3)
// RXB0D6<RXB0D64>
extern volatile __bit                   RXB0D64             __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 RXB0D64_bit         _BIT_ACCESS(RXB0D6,4)
// RXB0D6<RXB0D65>
extern volatile __bit                   RXB0D65             __at(0x7B65);	// @ (0xF6C * 8 + 5)
#define                                 RXB0D65_bit         _BIT_ACCESS(RXB0D6,5)
// RXB0D6<RXB0D66>
extern volatile __bit                   RXB0D66             __at(0x7B66);	// @ (0xF6C * 8 + 6)
#define                                 RXB0D66_bit         _BIT_ACCESS(RXB0D6,6)
// RXB0D6<RXB0D67>
extern volatile __bit                   RXB0D67             __at(0x7B67);	// @ (0xF6C * 8 + 7)
#define                                 RXB0D67_bit         _BIT_ACCESS(RXB0D6,7)
// RXB0D7<RXB0D70>
extern volatile __bit                   RXB0D70             __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 RXB0D70_bit         _BIT_ACCESS(RXB0D7,0)
// RXB0D7<RXB0D71>
extern volatile __bit                   RXB0D71             __at(0x7B69);	// @ (0xF6D * 8 + 1)
#define                                 RXB0D71_bit         _BIT_ACCESS(RXB0D7,1)
// RXB0D7<RXB0D72>
extern volatile __bit                   RXB0D72             __at(0x7B6A);	// @ (0xF6D * 8 + 2)
#define                                 RXB0D72_bit         _BIT_ACCESS(RXB0D7,2)
// RXB0D7<RXB0D73>
extern volatile __bit                   RXB0D73             __at(0x7B6B);	// @ (0xF6D * 8 + 3)
#define                                 RXB0D73_bit         _BIT_ACCESS(RXB0D7,3)
// RXB0D7<RXB0D74>
extern volatile __bit                   RXB0D74             __at(0x7B6C);	// @ (0xF6D * 8 + 4)
#define                                 RXB0D74_bit         _BIT_ACCESS(RXB0D7,4)
// RXB0D7<RXB0D75>
extern volatile __bit                   RXB0D75             __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 RXB0D75_bit         _BIT_ACCESS(RXB0D7,5)
// RXB0D7<RXB0D76>
extern volatile __bit                   RXB0D76             __at(0x7B6E);	// @ (0xF6D * 8 + 6)
#define                                 RXB0D76_bit         _BIT_ACCESS(RXB0D7,6)
// RXB0D7<RXB0D77>
extern volatile __bit                   RXB0D77             __at(0x7B6F);	// @ (0xF6D * 8 + 7)
#define                                 RXB0D77_bit         _BIT_ACCESS(RXB0D7,7)
// RXB0DLC<RXB0DLC0>
extern volatile __bit                   RXB0DLC0            __at(0x7B28);	// @ (0xF65 * 8 + 0)
#define                                 RXB0DLC0_bit        _BIT_ACCESS(RXB0DLC,0)
// RXB0DLC<RXB0DLC1>
extern volatile __bit                   RXB0DLC1            __at(0x7B29);	// @ (0xF65 * 8 + 1)
#define                                 RXB0DLC1_bit        _BIT_ACCESS(RXB0DLC,1)
// RXB0DLC<RXB0DLC2>
extern volatile __bit                   RXB0DLC2            __at(0x7B2A);	// @ (0xF65 * 8 + 2)
#define                                 RXB0DLC2_bit        _BIT_ACCESS(RXB0DLC,2)
// RXB0DLC<RXB0DLC3>
extern volatile __bit                   RXB0DLC3            __at(0x7B2B);	// @ (0xF65 * 8 + 3)
#define                                 RXB0DLC3_bit        _BIT_ACCESS(RXB0DLC,3)
// RXB0EIDL<RXB0EID0>
extern volatile __bit                   RXB0EID0            __at(0x7B20);	// @ (0xF64 * 8 + 0)
#define                                 RXB0EID0_bit        _BIT_ACCESS(RXB0EIDL,0)
// RXB0EIDL<RXB0EID1>
extern volatile __bit                   RXB0EID1            __at(0x7B21);	// @ (0xF64 * 8 + 1)
#define                                 RXB0EID1_bit        _BIT_ACCESS(RXB0EIDL,1)
// RXB0EIDH<RXB0EID10>
extern volatile __bit                   RXB0EID10           __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 RXB0EID10_bit       _BIT_ACCESS(RXB0EIDH,2)
// RXB0EIDH<RXB0EID11>
extern volatile __bit                   RXB0EID11           __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 RXB0EID11_bit       _BIT_ACCESS(RXB0EIDH,3)
// RXB0EIDH<RXB0EID12>
extern volatile __bit                   RXB0EID12           __at(0x7B1C);	// @ (0xF63 * 8 + 4)
#define                                 RXB0EID12_bit       _BIT_ACCESS(RXB0EIDH,4)
// RXB0EIDH<RXB0EID13>
extern volatile __bit                   RXB0EID13           __at(0x7B1D);	// @ (0xF63 * 8 + 5)
#define                                 RXB0EID13_bit       _BIT_ACCESS(RXB0EIDH,5)
// RXB0EIDH<RXB0EID14>
extern volatile __bit                   RXB0EID14           __at(0x7B1E);	// @ (0xF63 * 8 + 6)
#define                                 RXB0EID14_bit       _BIT_ACCESS(RXB0EIDH,6)
// RXB0EIDH<RXB0EID15>
extern volatile __bit                   RXB0EID15           __at(0x7B1F);	// @ (0xF63 * 8 + 7)
#define                                 RXB0EID15_bit       _BIT_ACCESS(RXB0EIDH,7)
// RXB0SIDL<RXB0EID16>
extern volatile __bit                   RXB0EID16           __at(0x7B10);	// @ (0xF62 * 8 + 0)
#define                                 RXB0EID16_bit       _BIT_ACCESS(RXB0SIDL,0)
// RXB0SIDL<RXB0EID17>
extern volatile __bit                   RXB0EID17           __at(0x7B11);	// @ (0xF62 * 8 + 1)
#define                                 RXB0EID17_bit       _BIT_ACCESS(RXB0SIDL,1)
// RXB0EIDL<RXB0EID2>
